nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1170/wifi_examples/uart_wifi_bridge/cm7/pin_mux.c
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_02_LPUART7_CTS_B, /* GPIO_AD_02 is configured as LPUART7_CTS_B */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_03_LPUART7_RTS_B, /* GPIO_AD_03 is configured as LPUART7_RTS_B */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_00_LPUART7_TXD, /* GPIO_AD_00 is configured as LPUART7_TX */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_01_LPUART7_RXD, /* GPIO_AD_01 is configured as LPUART7_RX */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_02_LPUART7_CTS_B, /* GPIO_AD_02 PAD functional properties : */
                        0x02U);                          /* Slew Rate Field: Slow Slew Rate
                                                              Drive Strength Field: R0/6
                                                              Speed Field: medium(100MHz)
                                                              Open Drain Enable Field: Open Drain Disabled
                                                              Pull / Keep Enable Field: Pull/Keeper Enabled
                                                              Pull / Keep Select Field: Keeper
                                                              Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                              Hyst. Enable Field: Hysteresis Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_03_LPUART7_RTS_B, /* GPIO_AD_03 PAD functional properties : */
                        0x02U);                          /* Slew Rate Field: Slow Slew Rate
                                                              Drive Strength Field: R0/6
                                                              Speed Field: medium(100MHz)
                                                              Open Drain Enable Field: Open Drain Disabled
                                                              Pull / Keep Enable Field: Pull/Keeper Enabled
                                                              Pull / Keep Select Field: Keeper
                                                              Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                              Hyst. Enable Field: Hysteresis Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_00_LPUART7_TXD,   /* GPIO_AD_00 PAD functional properties : */
                        0x02U);                          /* Slew Rate Field: Slow Slew Rate
                                                              Drive Strength Field: R0/6
                                                              Speed Field: medium(100MHz)
                                                              Open Drain Enable Field: Open Drain Disabled
                                                              Pull / Keep Enable Field: Pull/Keeper Enabled
                                                              Pull / Keep Select Field: Keeper
                                                              Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                              Hyst. Enable Field: Hysteresis Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_01_LPUART7_RXD,   /* GPIO_AD_01 PAD functional properties : */
                        0x02U);                          /* Slew Rate Field: Slow Slew Rate
                                                              Drive Strength Field: R0/6
                                                              Speed Field: medium(100MHz)
                                                              Open Drain Enable Field: Open Drain Disabled
                                                              Pull / Keep Enable Field: Pull/Keeper Enabled
                                                              Pull / Keep Select Field: Keeper
                                                              Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                              Hyst. Enable Field: Hysteresis Disabled */
}

void BOARD_InitSpiPins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc); /* LPCG on: LPCG is ON. */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_28_LPSPI1_SCK, /* GPIO_AD_28 is configured as LPSPI1_SCK */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_29_LPSPI1_PCS0, /* GPIO_AD_29 is configured as LPSPI1_PCS0 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_30_LPSPI1_SOUT, /* GPIO_AD_30 is configured as LPSPI1_SOUT */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_31_LPSPI1_SIN, /* GPIO_AD_31 is configured as LPSPI1_SIN */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_28_LPSPI1_SCK,  /* GPIO_AD_28 PAD functional properties : */
                        0x02U);                        /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: high drive strength
                                                            Pull / Keep Select Field: Pull Disable, Highz
                                                            Pull Up / Down Config. Field: Weak pull down
                                                            Open Drain Field: Disabled
                                                            Domain write protection: Both cores are allowed
                                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_29_LPSPI1_PCS0, /* GPIO_AD_29 PAD functional properties : */
                        0x02U);                        /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: high drive strength
                                                            Pull / Keep Select Field: Pull Disable, Highz
                                                            Pull Up / Down Config. Field: Weak pull down
                                                            Open Drain Field: Disabled
                                                            Domain write protection: Both cores are allowed
                                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_30_LPSPI1_SOUT, /* GPIO_AD_30 PAD functional properties : */
                        0x02U);                        /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: high drive strength
                                                            Pull / Keep Select Field: Pull Disable, Highz
                                                            Pull Up / Down Config. Field: Weak pull down
                                                            Open Drain Field: Disabled
                                                            Domain write protection: Both cores are allowed
                                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_31_LPSPI1_SIN,  /* GPIO_AD_31 PAD functional properties : */
                        0x02U);                        /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: high drive strength
                                                            Pull / Keep Select Field: Pull Disable, Highz
                                                            Pull Up / Down Config. Field: Weak pull down
                                                            Open Drain Field: Disabled
                                                            Domain write protection: Both cores are allowed
                                                            Domain write protection lock: Neither of DWP bits is locked */
}

